#+title: making zinemachine 2.0

* What is wrong with 1.0?
1. doesn't work. pyhtml2pdf doesnt like my chromium and im tired of fighting with this module
2. unlogical structure. After stepping away for a few weeks I no logner understand how it works
3. It wasn't really an issue but preformance was pretty slow. Using a whole as broswer to render one page is pretty slow :/

* Do List! 1.0 [8/8]
** DONE Touch render.py
:LOGBOOK:
CLOCK: [2023-08-26 Sat 15:14]--[2023-08-26 Sat 15:15] =>  0:01
:END:
** DONE Set up dirs.
** DONE Git Init
:LOGBOOK:
CLOCK: [2023-08-26 Sat 15:16]--[2023-08-26 Sat 15:17] =>  0:01
:END:
** KILL Make html2pdf work [8/8]
*** DONE Hello world
:LOGBOOK:
CLOCK: [2023-08-26 Sat 15:17]--[2023-08-26 Sat 15:21] =>  0:04
:END:

*** DONE Take paths
:LOGBOOK:
CLOCK: [2023-08-26 Sat 15:22]--[2023-08-26 Sat 15:27] =>  0:05
:END:
*** DONE Put a real file there
*** DONE Open Selenium
:LOGBOOK:
CLOCK: [2023-08-26 Sat 15:43]--[2023-08-26 Sat 15:50] =>  0:07
:END:
*** DONE Go to the website
*** DONE Close Selenium
*** DONE Pull driver and wait from config
:LOGBOOK:
CLOCK: [2023-08-26 Sat 16:07]--[2023-08-26 Sat 16:18] =>  0:11
:END:
*** KILL make it print!
** KILL Make generic work
** KILL Celebrate proof of concept
** KILL Make accordian
** KILL Make digital.
* Do List! 2.0 [7/7]
Okay so actually fuck html, fuck markdown, i'm just gonna make the rendering tool myself from a json file.
** DONE Hello World with Pillow
:LOGBOOK:
CLOCK: [2023-08-27 Sun 14:33]--[2023-08-27 Sun 15:29] =>  0:56
:END:
** DONE Render a blank page
:LOGBOOK:
CLOCK: [2023-08-27 Sun 15:29]--[2023-08-27 Sun 15:36] =>  0:07
:END:
** DONE Get programmer art
:LOGBOOK:
CLOCK: [2023-08-27 Sun 16:03]--[2023-08-27 Sun 16:07] =>  0:04
:END:
** DONE Render a pagelet on a page
** DONE Make JSON for generic (can you borrow from divider?)
:LOGBOOK:
CLOCK: [2023-08-27 Sun 19:31]--[2023-08-27 Sun 19:35] =>  0:04
:END:
** DONE Render according to the JSON
:LOGBOOK:
CLOCK: [2023-08-27 Sun 19:35]--[2023-08-27 Sun 21:14] =>  1:39
:END:
** DONE Celebrate proof of concept
* Do List 1.5! [27/27]
So in theory, all the technical challenges are adressed. Current stratagy is just follow a zine all the way through my map, and make the shit actually work as it passes through
** DONE Get the zine scanned and prepared (generic)
:LOGBOOK:
CLOCK: [2023-08-28 Mon 13:24]--[2023-08-28 Mon 13:34] =>  0:10
:END:
** DONE import the divider tool
:LOGBOOK:
CLOCK: [2023-08-28 Mon 13:34]--[2023-08-28 Mon 13:41] =>  0:07
:END:
** KILL Try: attempt to cut up the zine
** DONE Actually the divider needs caching util.
:LOGBOOK:
CLOCK: [2023-08-28 Mon 13:41]--[2023-08-28 Mon 13:58] =>  0:17
:END:
** DONE except: fix the divier tool
:LOGBOOK:
CLOCK: [2023-08-28 Mon 13:59]--[2023-08-28 Mon 14:24] =>  0:25
:END:
** DONE test!
** DONE No module named pypdf
** DONE test!
** DONE Make the zine avtuall a pdf...
:LOGBOOK:
CLOCK: [2023-08-28 Mon 14:29]--[2023-08-28 Mon 14:31] =>  0:02
:END:
** DONE test!!!
** DONE faulty inpages saftey
:LOGBOOK:
CLOCK: [2023-08-28 Mon 14:31]--[2023-08-28 Mon 14:33] =>  0:02
:END:
** DONE Test!!!
** DONE Spelling mistakes
:LOGBOOK:
CLOCK: [2023-08-28 Mon 14:34]--[2023-08-28 Mon 14:35] =>  0:01
:END:
** DONE Test and fix until pass
:LOGBOOK:
CLOCK: [2023-08-28 Mon 14:35]--[2023-08-28 Mon 14:47] =>  0:12
:END:
** DONE Successfully cut the zine. (its now in inpages)
** OKAY Make the caching util
** DONE Take a lil break
** DONE Make a template for accordian
:LOGBOOK:
CLOCK: [2023-08-28 Mon 16:24]--[2023-08-28 Mon 16:27] =>  0:03
:END:
** DONE Begin work on render.py
** DONE Set up the JSON
:LOGBOOK:
CLOCK: [2023-08-28 Mon 16:47]--[2023-08-28 Mon 16:50] =>  0:03
:END:
** DONE Cache front four pages
:LOGBOOK:
CLOCK: [2023-08-28 Mon 16:50]--[2023-08-28 Mon 17:02] =>  0:12
CLOCK: [2023-08-28 Mon 16:27]--[2023-08-28 Mon 16:46] =>  0:19
:END:
** DONE Render them
:LOGBOOK:
CLOCK: [2023-08-28 Mon 17:03]--[2023-08-28 Mon 17:40] =>  0:37
:END:
** DONE Cache back four pages
:LOGBOOK:
CLOCK: [2023-08-28 Mon 17:50]--[2023-08-28 Mon 18:02] =>  0:12
:END:
** DONE Render them
** DONE Break
:LOGBOOK:
CLOCK: [2023-08-28 Mon 18:02]--[2023-08-28 Mon 18:08] =>  0:06
:END:
** DONE Unite them
:LOGBOOK:
CLOCK: [2023-08-28 Mon 18:08]--[2023-08-28 Mon 18:14] =>  0:06
:END:
** DONE Send to Print.pdf
** TODO Test it!
** TODO Git Commit!
** TODO Celebrate!!!
* Future todo [/]
** TODO Make the input and outfiles dynamic
** TODO Make a digital zine make script in python instead of shell
